# Regular packages
brew 'coreutils'
brew 'git'
brew 'the_silver_searcher'
brew 'curl'
brew 'wget'
brew 'htop'
brew 'jq'
brew 'openssh'
brew 'openssl'
brew 'vim'
brew 'mas'
brew 'ssh-copy-id'
brew 'podman'

# Cask packages
cask 'miniconda'
cask 'visual-studio-code'
cask 'iterm2'
cask 'postman'

# Fonts
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'font-source-code-pro'