# Regular packages
brew 'coreutils'
brew 'git'
brew 'the_silver_searcher'
brew 'curl'
brew 'wget'
brew 'htop'
brew 'jq'
brew 'openssh'
brew 'openssl'
brew 'vim'
brew 'mas'
brew 'ssh-copy-id'
brew 'podman'
brew 'cmake'
brew 'clang-format'
brew 'python@3.11'
brew 'pipx'
brew 'libomp'

# C++ development tools
brew 'llvm'
brew 'gcc'
brew 'gdb'
brew 'boost'
brew 'ninja'
brew 'ccache'
brew 'cppcheck'
brew 'valgrind'

# Cask packages
cask 'miniconda'
cask 'visual-studio-code'
cask 'cursor'
cask 'iterm2'
cask 'postman'

# Fonts
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'font-source-code-pro'
