# Vim
vscodevim.vim

# Python
ms-python.python
ms-python.pylint
ms-python.black-formatter
ms-python.isort
ms-python.debugpy
ms-python.vscode-pylance

# C/C++
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
twxs.cmake
xaver.clang-format
jeff-hykin.better-cpp-syntax
cschlosser.doxdocgen

# Git
eamodio.gitlens

# Documentation
njpwerner.autodocstring

# TOML
tamasfe.even-better-toml

# AI
continue.continue

# Code runner
formulahendry.code-runner

# Themes
wheredoesyourmindgo.gruvbox-concoctis
arcticicestudio.nord-visual-studio-code

# Tools
dorianmassoulier.repomix-runner
gruntfuggly.todo-tree
shardulm94.trailing-spaces
